package tasks

/*
	Фит с командой
	- Возможно на встрече еще будет представиль бизнеса (т.е. непосредственный заказчик продукта). Тут стоит словить +вайб и просто мило пообщаться.
	- Подготовить пул вопросов команде:
		1. Сколько длится онбординг и в каком формате он проходит?
		2. Какие передо мной будут стоять задачи в момент онбординга?
		3. Как вы планируете задачи, и как их распределяете? Проводится ли покер планирование?
		4. Как выстроена коммуникация в команде? Являются ли нормальными случаи, когда необходимо обратиться к коллеге и сделать это несколько раз?
		5. Какой % задач направлен на кодинг на гошке?
		6. Какая часть работы занимает девопс?
		7. Какой формат работы? Есть ли удаленка?
		8. Можно ли работать из Минска?
		9. В каком формате я могу активничать в структуре Сбера (помимо рабочих задач)?
		10. Могу ли я выпускать статьи на блоге Сбера на Хабре?
		11. Каковы критерии для повышения и насколько они строги? Кто непосредственно принимает решения о том, что сотрудника можно повысить? Есть ли какие-то ограничения по росту?
		12. Много ли бюрократии?
		13. Есть ли токсичные люди в команде? Как решаются конфликтные ситуации?
		14. Представим ситуацию: от задачи, которую мне хотят дать, меня будет "тошнить". Как в таком случае решается данная ситуация?
	- На встрече будут присутствовать CTO, лид-продукта, HR (вероятно)
	- Состоит из двух частей:
		1. Их вопросы к тебе. По большей части эти вопросы софтовые. Будут спрашивать про твой опыт (здесь стоит подготовить пул самых лучших задач или проектов, которые ты делал). Возможны вопросы по типу:
			- Чем занимался на рабочем месте?
			- Какие задачи считаешь самыми лучшими? Какие были трудности и как ты с ними справился?
			- Расскажи про задачу, которую ты завалил и как ты справился с ситуацией?
			- Представь, что тебе дают задачу, которую ты не хочешь делать, как будешь решать этот кейс? Ответ: я попробую сделегировать, если будет такая возможность или же буду чередовать задачи из спринта с этой.
			- Чего хочется? (Здесь ты должен заранее подготовить ахуитительную речь про то, как ты замотивирован и почему)
			- Как ты решаешь конфликты?
			- Как относишься к переработкам? (Тут нужно очень сглаженно ответить)
			- Представь ситуацию, что приоритет задач меняется и тебя это триггерит, как будешь выруливать данный кейс?
		2. Твои вопросы к ним
		3. Перед встречей стоит быть в хорошем настроении и выспавшимся, ты должен с первого момента словить плюс вайб. Чтобы сделать их снисходительнее предупреди, что ты приболел и если что, необходимо будет отойти.
*/
